import datetime
import streamlit as st

liushisi_gua =['中孚',"復","屯","謙","睽","升","臨","小過",\
               '蒙',"益","漸","泰","需","随","晋","解",\
               '大壮',"豫","訟","蠱","革","夬","旅","師",\
               '比',"小畜","乾","大有","家人","井","咸","姤",\
               '鼎',"豊","渙","履","遯","恒","節","同人",\
               '損',"否","巽","萃","大畜","賁","観","帰妹",\
               '无妄',"明夷","困","剥","艮","既済","噬嗑","大過",\
               '坤',"未済","蹇","頤"]

yao_list=['初爻','二爻','三爻','四爻','五爻','上爻']

yaoci ={'乾':{'初爻': '潛龍,勿用。',
    '二爻':'見龍在田，利見大人。' ,
    '三爻':'君子終日乾乾，夕惕若厲，无咎' ,
    '四爻':'或躍在淵，无咎。' ,
    '五爻':'飛龍在天，利見大人。' ,
    '上爻':'亢龍有悔。' 
        },
    '坤':{'初爻': '履霜，堅冰至。',
    '二爻':'直方大，不習无不利。' ,
    '三爻':'含章可貞。或従王事，无成有終。' ,
    '四爻':'括囊；无咎，无誉。' ,
    '五爻':'黄裳，元吉。' ,
    '上爻':'龍戦于野，其血玄黄。' 
        },
    '屯':{'初爻': '磐桓。利居貞，利建侯。',
    '二爻':'屯如邅如，乗馬班如。匪寇婚媾，女子貞不字，十年乃字。' ,
    '三爻':'即鹿无虞，惟入于林中，君子幾不如舍，往吝。' ,
    '四爻':'乗馬班如，求婚媾，往吉，无不利。' ,
    '五爻':'屯其膏，小貞吉，大貞凶。' ,
    '上爻':'乗馬班如，泣血漣如。' 
        },
    '蒙':{'初爻': '発蒙，利用刑人，用説桎梏，以往吝。',
    '二爻':'包蒙吉。納婦吉。子克家。' ,
    '三爻':'勿用取女。見金夫，不有躬，无攸利。' ,
    '四爻':'困蒙，吝。' ,
    '五爻':'童蒙，吉。' ,
    '上爻':'撃蒙。不利為寇，利禦寇。' 
        },
    '需':{'初爻': '需于郊。利用恆，无咎。',
    '二爻':'需于沙。小有言，終吉。' ,
    '三爻':'需于泥，致寇至。' ,
    '四爻':'需于血，出自穴。' ,
    '五爻':'需于酒食，貞吉。' ,
    '上爻':'入于穴，有不速之客三人来，敬之終吉。' 
        },
    '訟':{'初爻': '不永所事，小有言，終吉。',
    '二爻':'不克訟，帰而逋，其邑人三百戶，无眚。' ,
    '三爻':'食旧德，貞厲，終吉，或従王事，无成。' ,
    '四爻':'不克訟，復即命渝，安貞吉。' ,
    '五爻':'訟元吉。' ,
    '上爻':'或錫之鞶帯，終朝三褫之。' 
        },
    '師':{'初爻': '師出以律，否臧凶。',
    '二爻':'在師中吉，无咎，王三錫命。' ,
    '三爻':'師或輿尸，凶。' ,
    '四爻':'師左次，无咎。' ,
    '五爻':'田有禽，利執言，无咎。長子帥師，弟子輿尸，貞凶。' ,
    '上爻':'大君有命，開国承家，小人勿用。' 
        },
    '比':{'初爻': '有孚，比之，无咎。有孚盈缶，終来有它吉。',
    '二爻':'比之自內，貞吉。' ,
    '三爻':'比之匪人。' ,
    '四爻':'外比之，貞吉。' ,
    '五爻':'顕比，王用三駆，失前禽。邑人不誡，吉。' ,
    '上爻':'比之无首，凶。' 
        },
    '小畜':{'初爻': '復自道，何其咎，吉。。',
    '二爻':'牽復，吉。' ,
    '三爻':'輿説輻，夫妻反目。' ,
    '四爻':'有孚，血去惕出，无咎。' ,
    '五爻':'有孚攣如，富以其鄰。' ,
    '上爻':'既雨既処，尚徳載，婦貞厲。月幾望，君子征凶。' 
        },
    '履':{'初爻': '素履，往无咎。',
    '二爻':'履道坦坦，幽人貞吉。' ,
    '三爻':'眇能視，跛能履，履虎尾，咥人，凶。武人為于大君。' ,
    '四爻':'履虎尾，愬愬，終吉。' ,
    '五爻':'夬履，貞厲。' ,
    '上爻':'視履考祥，其旋元吉。' 
        },
    '泰':{'初爻': '拔茅茹，以其彙，征吉。',
    '二爻':'包荒，用馮河，不遐遺，朋亡，得尚于中行。' ,
    '三爻':'无平不陂，无往不復，艱貞无咎。勿恤其孚，于食有福。' ,
    '四爻':'翩翩，不富，以其鄰，不戒以孚。' ,
    '五爻':'帝乙帰妹，以祉元吉。' ,
    '上爻':'城復于隍，勿用師。自邑告命，貞吝。' 
        },
    '否':{'初爻': '拔茅茹，以其彙，貞吉亨。',
    '二爻':'包承。小人吉，大人否，亨。' ,
    '三爻':'包羞。' ,
    '四爻':'有命，无咎，疇離祉。' ,
    '五爻':'休否，大人吉。其亡其亡，繫于苞桑。' ,
    '上爻':'傾否，先否後喜。' 
        },
    '同人':{'初爻': '同人于門，无咎。',
    '二爻':'同人于宗，吝。' ,
    '三爻':'伏戎于莽，升其高陵，三歲不興。' ,
    '四爻':'乗其墉，弗克攻，吉。' ,
    '五爻':'同人，先號咷而後笑。大師克相遇。' ,
    '上爻':'同人于郊，无悔。' 
        },
    '大有:':{'初爻': '无交害，匪咎，艱則无咎。',
    '二爻':'大車以載，有攸往，无咎。' ,
    '三爻':'公用亨于天子，小人弗克。' ,
    '四爻':'匪其彭，无咎。' ,
    '五爻':'厥孚交如，威如；吉。' ,
    '上爻':'自天祐之，吉无不利。' 
        },
    '謙':{'初爻': '謙謙君子，用涉大川，吉。',
    '二爻':'鳴謙，貞吉。' ,
    '三爻':'労謙，君子有終，吉。' ,
    '四爻':'无不利，撝謙。' ,
    '五爻':'不富，以其鄰，利用侵伐，无不利。' ,
    '上爻':'鳴謙，利用行師，征邑国。' 
        },
    '豫':{'初爻': '鳴豫，凶。',
    '二爻':'介于石，不終日，貞吉。' ,
    '三爻':'盱豫，悔。遲有悔。' ,
    '四爻':'由豫，大有得。勿疑。朋盍簪。' ,
    '五爻':'貞疾，恒不死。' ,
    '上爻':'冥豫，成有渝，无咎。' 
        },
    '随':{'初爻': '官有渝，貞吉。出門交有功。',
    '二爻':'係小子，失丈夫。' ,
    '三爻':'係丈夫，失小子。隨有求得，利居貞。' ,
    '四爻':'隨有獲，貞凶。有孚在道，以明，何咎。' ,
    '五爻':'孚于嘉，吉。' ,
    '上爻':'拘係之，乃従維之。王用亨于西山。' 
        },   
    '蠱':{'初爻': '幹父之蠱，有子，考无咎，厲終吉。',
    '二爻':'幹母之蠱，不可貞。' ,
    '三爻':'幹父之蠱，小有悔，无大咎。' ,
    '四爻':'裕父之蠱，往見吝。' ,
    '五爻':'幹父之蠱，用誉。' ,
    '上爻':'不事王侯，高尚其事。' 
        },     
    '臨':{'初爻': '咸臨，貞吉。',
    '二爻':'咸臨，吉无不利。' ,
    '三爻':'甘臨，无攸利。既憂之，无咎。' ,
    '四爻':'至臨，无咎。' ,
    '五爻':'知臨，大君之宜，吉。' ,
    '上爻':'敦臨，吉无咎。' 
        },
    '観':{'初爻': '童観，小人无咎，君子吝。',
    '二爻':'闚観，利女貞。' ,
    '三爻':'観我生，進退。' ,
    '四爻':'観国之光，利用賓于王。' ,
    '五爻':'観我生，君子无咎。' ,
    '上爻':'観其生，君子无咎。' 
        },
    '噬嗑':{'初爻': '童観，小人屨校滅趾，无咎。',
    '二爻':'噬膚滅鼻，无咎。' ,
    '三爻':'噬臘肉，遇毒；小吝，无咎。' ,
    '四爻':'噬乾胏，得金矢，利艱貞，吉。' ,
    '五爻':'噬乾肉，得黃金，貞厲，无咎。' ,
    '上爻':'何校滅耳，凶。' 
        },
    '賁':{'初爻': '賁其趾，舍車而徒。',
    '二爻':'賁其須。' ,
    '三爻':'賁如濡如，永貞吉。' ,
    '四爻':'賁如皤如，白馬翰如，匪寇婚媾。' ,
    '五爻':'賁于丘園，束帛戔戔，吝，終吉。' ,
    '上爻':'白賁，无咎。' 
        },
    '剥':{'初爻': '剥床以足，蔑貞凶。',
    '二爻':'剥床以弁，蔑貞凶。' ,
    '三爻':'剥之，无咎。' ,
    '四爻':'剥床以膚，凶。' ,
    '五爻':'貫魚，以宮人寵，无不利。' ,
    '上爻':'碩果不食，君子得輿，小人剥廬。' 
        },
    '復':{'初爻': '不遠復，无祗悔，元吉。',
    '二爻':'休復，吉。' ,
    '三爻':'頻復，厲无咎。' ,
    '四爻':'中行独復。' ,
    '五爻':'敦復，无悔。' ,
    '上爻':'迷復，凶，有災眚。用行師，終有大敗，以其国君，凶。至于十年，不克征。' 
        },
    '无妄':{'初爻': '无妄，往吉。',
    '二爻':'不耕獲，不菑畬，則利有攸往。' ,
    '三爻':'无妄之災，或繫之牛，行人之得，邑人之災。' ,
    '四爻':'可貞，无咎。' ,
    '五爻':'无妄之疾，勿薬有喜。' ,
    '上爻':'无妄，行有眚，无攸利。' 
        },
    '大畜':{'初爻': '有厲利已。',
    '二爻':'輿説輹。' ,
    '三爻':'良馬逐，利艱貞。曰閑輿衛，利有攸往。' ,
    '四爻':'童牛之牿，元吉。' ,
    '五爻':'豶豕之牙，吉。' ,
    '上爻':'何天之衢，亨。' 
        },
    '頤':{'初爻': '舍爾靈龜，觀我朵頤，凶。',
    '二爻':'顛頤，拂経，于丘頤，征凶。' ,
    '三爻':'拂頤，貞凶，十年勿用，无攸利。' ,
    '四爻':'顛頤，吉，虎視眈眈，其欲逐逐，无咎。' ,
    '五爻':'拂経，居貞吉，不可涉大川。' ,
    '上爻':'由頤，厲吉，利涉大川。' 
        },
    '大過':{'初爻': '藉用白茅，无咎。',
    '二爻':'枯楊生稊，老夫得其女妻，无不利。' ,
    '三爻':'棟橈，凶。' ,
    '四爻':'棟隆，吉；有它吝。' ,
    '五爻':'枯楊生華，老婦得士夫，无咎无誉。' ,
    '上爻':'過渉滅頂，凶，无咎。' 
        },
    '坎':{'初爻': '習坎，入于坎窞，凶。',
    '二爻':'坎有険，求小得。' ,
    '三爻':'来之坎坎，険且枕，入于坎窞，勿用。' ,
    '四爻':'樽酒簋貳，用缶，納約自牖，終无咎。' ,
    '五爻':'坎不盈，祗既平，无咎。' ,
    '上爻':'係用徽纆，寘于叢棘，三歳不得，凶。' 
        },
    '離':{'初爻': '履錯然，敬之无咎。',
    '二爻':'黄離，元吉。' ,
    '三爻':'日昃之離，不鼓缶而歌，則大耋之嗟，凶。' ,
    '四爻':'突如其来如，焚如，死如，棄如。' ,
    '五爻':'出涕沱若，戚嗟若，吉。' ,
    '上爻':'王用出征，有嘉折首，獲匪其醜，无咎。' 
        },
    '咸':{'初爻': '咸其拇。',
    '二爻':'咸其腓，凶，居吉。' ,
    '三爻':'咸其股，執其隨，往吝。' ,
    '四爻':'貞吉，悔亡，憧憧往来，朋従爾思。' ,
    '五爻':'咸其脢，无悔。' ,
    '上爻':'咸其輔頰舌。' 
        },
    '恒':{'初爻': '悔亡。',
    '二爻':'不恒其德，或承之羞，貞吝。' ,
    '三爻':'不恒其德，或承之羞，貞吝。' ,
    '四爻':'田无禽。' ,
    '五爻':'恒其徳，貞，婦人吉，夫子凶。' ,
    '上爻':'振恒，凶。' 
        },
    '遯':{'初爻': '遯尾，厲，勿用有攸往。',
    '二爻':'執之用黃牛之革，莫之勝説。' ,
    '三爻':'係遯，有疾厲，畜臣妾吉。' ,
    '四爻':'好遯，君子吉，小人否。' ,
    '五爻':'嘉遯，貞吉。' ,
    '上爻':'肥遯，无不利。' 
        },
    '大壮':{'初爻': '壮于趾，征凶，有孚。',
    '二爻':'貞吉。' ,
    '三爻':'小人用壮，君子用罔，貞厲。羝羊觸藩，羸其角。' ,
    '四爻':'貞吉悔亡，藩決不羸，壮于大輿之輹。' ,
    '五爻':'喪羊于易，无悔。' ,
    '上爻':'羝羊觸藩，不能退，不能遂，无攸利，艱則吉。' 
        },
    '晋':{'初爻': '晋如，摧如，貞吉。罔孚，裕无咎。',
    '二爻':'晋如，愁如，貞吉。受茲介福，于其王母。' ,
    '三爻':'衆允，悔亡。' ,
    '四爻':'晋如碩鼠，貞厲。' ,
    '五爻':'悔亡，失得勿恤，往吉，无不利。' ,
    '上爻':'晋其角，維用伐邑，厲吉无咎，貞吝。' 
        },
    '明夷':{'初爻': '明夷于飛，垂其翼。君子于行，三日不食，有攸往，主人有言。',
    '二爻':'明夷，夷于左股，用拯馬壮，吉。' ,
    '三爻':'明夷于南狩，得其大首，不可疾貞。' ,
    '四爻':'入于左腹，獲明夷之心，出于門庭。' ,
    '五爻':'箕子之明夷，利貞。' ,
    '上爻':'不明晦，初登于天，後入于地。' 
        },
    '家人':{'初爻': '閑有家，悔亡。',
    '二爻':'无攸遂，在中饋，貞吉。' ,
    '三爻':'家人嗃嗃，悔厲吉；婦子嘻嘻，終吝。' ,
    '四爻':'富家，大吉。' ,
    '五爻':'王仮有家，勿恤，往吉。' ,
    '上爻':'有孚威如，終吉。' 
        },
    '睽':{'初爻': '悔亡，喪馬勿逐，自復；見悪人无咎。',
    '二爻':'遇主于巷，无咎。' ,
    '三爻':'見輿曳，其牛掣，其人天且劓，无初有終。' ,
    '四爻':'睽孤，遇元夫，交孚，厲无咎。' ,
    '五爻':'悔亡，厥宗噬膚，往何咎。' ,
    '上爻':'睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧，匪寇婚媾，往遇雨則吉。' 
        },
    '蹇':{'初爻': '往蹇，来誉。',
    '二爻':'王臣蹇蹇，匪躬之故。' ,
    '三爻':'往蹇来反。' ,
    '四爻':'往蹇来連。' ,
    '五爻':'大蹇朋来。' ,
    '上爻':'往蹇来碩，吉；利見大人。' 
        },
    '解':{'初爻': '无咎。',
    '二爻':'田獲三狐，得黃矢，貞吉。' ,
    '三爻':'負且乗，致寇至，貞吝。' ,
    '四爻':'解而拇，朋至斯孚。' ,
    '五爻':'君子維有解，吉；有孚于小人。' ,
    '上爻':'公用射隼于高墉之上，獲之，无不利。' 
        },
    '損':{'初爻': '巳事遄往，无咎，酌損之。',
    '二爻':'利貞，征凶，弗損，益之。' ,
    '三爻':'三人行，則損一人；一人行，則得其友。' ,
    '四爻':'損其疾，使遄有喜，无咎。' ,
    '五爻':'或益之，十朋之亀弗克違，元吉。' ,
    '上爻':'弗損益之，无咎，貞吉，有攸往，得臣无家。' 
        },
    '益':{'初爻': '利用為大作，元吉，无咎。',
    '二爻':'或益之，十朋之亀弗克違，永貞吉。王用享于帝，吉。' ,
    '三爻':'益之用凶事，无咎。有孚中行，告公用圭。' ,
    '四爻':'中行，告公従。利用為依遷国。' ,
    '五爻':'有孚恵心，勿問元吉。有孚恵我徳。' ,
    '上爻':'莫益之，或擊之，立心勿恒，凶。' 
        },
    '夬':{'初爻': '壮于前趾，往不勝為咎。',
    '二爻':'惕号，莫夜有戎，勿恤。' ,
    '三爻':'壮于頄，有凶。君子夬夬，独行，遇雨，若濡，有慍，无咎。' ,
    '四爻':'臀无膚，其行次且。牽羊悔亡，聞言不信。' ,
    '五爻':'莧陸夬夬，中行无咎。' ,
    '上爻':'无号，終有凶。' 
        },
    '姤':{'初爻': '繋于金柅，貞吉，有攸往，見凶，羸豕孚蹢躅。',
    '二爻':'包有魚，无咎，不利賓。' ,
    '三爻':'臀无膚，其行次且，厲，无大咎。' ,
    '四爻':'包无魚，起凶。' ,
    '五爻':'以杞包瓜，含章，有隕自天。' ,
    '上爻':'姤其角，吝，无咎。' 
        },
    '萃':{'初爻': '有孚不終，乃乱乃萃，若號一握為笑，勿恤，往无咎。',
    '二爻':'引吉，无咎，孚乃利用禴。' ,
    '三爻':'萃如，嗟如，无攸利，往无咎，小吝。' ,
    '四爻':'大吉，无咎。' ,
    '五爻':'萃有位，无咎。匪孚，元永貞，悔亡。' ,
    '上爻':'齎咨涕洟，无咎。' 
        },
    '升':{'初爻': '允升，大吉。',
    '二爻':'孚乃利用禴，无咎。' ,
    '三爻':'升虚邑。' ,
    '四爻':'王用亨于岐山，吉无咎。' ,
    '五爻':'貞吉，升階。' ,
    '上爻':'冥升，利于不息之貞。' 
        },
    '困':{'初爻': '臀困于株木，入于幽谷，三歳不覿。',
    '二爻':'困于酒食，朱紱方来，利用享祀，征凶，无咎。' ,
    '三爻':'困于石，據于蒺蔾，入于其宮，不見其妻，凶。' ,
    '四爻':'来徐徐，困于金車，吝，有終。' ,
    '五爻':'劓刖，困于赤紱，乃徐有説，利用祭祀。' ,
    '上爻':'困于葛藟，于臲卼，曰動悔。有悔，征吉。' 
        },
    '井':{'初爻': '井泥不食，舊井无禽。',
    '二爻':'井谷射鮒，瓮敝漏。' ,
    '三爻':'井渫不食，為我心惻，可用汲，王明，並受其福。' ,
    '四爻':'井甃，无咎。' ,
    '五爻':'井冽，寒泉食。' ,
    '上爻':'井收勿幕，有孚元吉。' 
        },
    '革':{'初爻': '鞏用黃牛之革。',
    '二爻':'巳日乃革之，征吉，无咎。' ,
    '三爻':'征凶，貞厲，革言三就，有孚。' ,
    '四爻':'悔亡，有孚改命，吉。' ,
    '五爻':'大人虎変，未占有孚。' ,
    '上爻':'君子豹変，小人革面，征凶，居貞吉。' 
        },
    '鼎':{'初爻': '鼎顛趾，利出否，得妾以其子，无咎。',
    '二爻':'鼎有實，我仇有疾，不我能即，吉。' ,
    '三爻':'鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。' ,
    '四爻':'鼎折足，覆公餗，其形渥，凶。' ,
    '五爻':'鼎黃耳，金鉉，利貞。' ,
    '上爻':'鼎玉鉉，大吉，无不利。' 
        },
    '震':{'初爻': '震来虩虩，後笑言啞啞，吉。',
    '二爻':'震来厲，億喪貝，躋于九陵，勿逐，七日得。' ,
    '三爻':'震蘇蘇，震行无眚。' ,
    '四爻':'震遂泥。' ,
    '五爻':'震往来厲，億无喪，有事。' ,
    '上爻':'震索索，視矍矍，征凶。震不于其躬，于其鄰，无咎。婚媾有言。' 
        },
    '艮':{'初爻': '艮其趾，无咎，利永貞。',
    '二爻':'艮其腓，不拯其隨，其心不快。' ,
    '三爻':'艮其限，列其夤，厲薰心。' ,
    '四爻':'艮其身，无咎。' ,
    '五爻':'艮其輔，言有序，悔亡。' ,
    '上爻':'敦艮，吉。' 
        },
    '漸':{'初爻': '鴻漸于干，小子厲，有言，无咎。',
    '二爻':'鴻漸于磐，飲食衎衎，吉。' ,
    '三爻':'鴻漸于陸，夫征不復，婦孕不育，凶。利禦寇。' ,
    '四爻':'鴻漸于木，或得其桷，无咎。' ,
    '五爻':'鴻漸于陵，婦三歳不孕，終莫之勝，吉。' ,
    '上爻':'鴻漸于陸，其羽可用為儀，吉。' 
        },
    '帰妹':{'初爻': '帰妹以娣，跛能履，征吉。',
    '二爻':'眇能視，利幽人之貞。' ,
    '三爻':'帰妹以須，反帰以娣。' ,
    '四爻':'帰妹愆期，遅帰有時。' ,
    '五爻':'帝乙歸妹，其君之袂，不如其娣之袂良，月幾望，吉。' ,
    '上爻':'女承筐无實，士刲羊无血，无攸利。' 
        },
    '豊':{'初爻': '遇其配主，雖旬无咎，往有尚。',
    '二爻':'豊其蔀，日中見斗，往得疑疾，有孚發若，吉。' ,
    '三爻':'豊其沛，日中見沬，折其右肱，无咎。' ,
    '四爻':'豊其蔀，日中見斗，遇其夷主，吉。' ,
    '五爻':'来章，有慶譽，吉。' ,
    '上爻':'豊其屋，蔀其家，闚其戶，闃其无人，三歳不覿，凶。'
        },
    '旅':{'初爻': '旅瑣瑣，斯其所取災。',
    '二爻':'旅即次，懐其資，得童僕貞。' ,
    '三爻':'旅焚其次，喪其童僕，貞厲。' ,
    '四爻':'旅于處，得其資斧，我心不快。' ,
    '五爻':'射雉一矢亡，終以誉命。' ,
    '上爻':'鳥焚其巣，旅人先笑後号咷。喪牛于易，凶。'
        },
    '旅':{'初爻': '進退，利武人之貞。',
    '二爻':'巽在床下，用史巫紛若，吉，无咎。' ,
    '三爻':'頻巽，吝。' ,
    '四爻':'悔亡，田獲三品。' ,
    '五爻':'貞吉悔亡，无不利。无初有終，先庚三日，後庚三日，吉。' ,
    '上爻':'巽在床下，喪其資斧，貞凶。'
        },
    '兌':{'初爻': '和兌，吉。',
    '二爻':'孚兌，吉，悔亡。' ,
    '三爻':'来兌，凶。' ,
    '四爻':'商兌，未寧，介疾有喜。' ,
    '五爻':'孚于剝，有厲。' ,
    '上爻':'引兌。'
        },
    '渙':{'初爻': '用拯馬壯，吉。',
    '二爻':'渙奔其机，悔亡。' ,
    '三爻':'渙其躬，无悔。' ,
    '四爻':'渙其群，元吉。渙有丘，匪夷所思。' ,
    '五爻':'渙汗其大号，渙王居，无咎。' ,
    '上爻':'渙其血，去逖出，无咎。'
        },
    '節':{'初爻': '不出戸庭，无咎。',
    '二爻':'不出門庭，凶。' ,
    '三爻':'不節若，則嗟若，无咎。' ,
    '四爻':'安節，亨。' ,
    '五爻':'甘節，吉；往有尚。' ,
    '上爻':'苦節，貞凶，悔亡。'
        },
    '中孚':{'初爻': '虞吉，有它不燕。',
    '二爻':'鳴鶴在陰，其子和之，我有好爵，吾与爾靡之。' ,
    '三爻':'得敵，或鼓或罷，或泣或歌。' ,
    '四爻':'月幾望，馬匹亡，无咎。' ,
    '五爻':'有孚攣如，无咎。' ,
    '上爻':'翰音登于天，貞凶。'
        },
    '小過':{'初爻': '飛鳥以凶。',
    '二爻':'過其祖，遇其妣；不及其君，遇其臣；无咎。' ,
    '三爻':'弗過防之，從或戕之，凶。' ,
    '四爻':'无咎，弗過遇之。往厲必戒，勿用永貞。' ,
    '五爻':'密雲不雨，自我西郊，公弋取彼在穴。' ,
    '上爻':'弗遇過之，飛鳥離之，凶，是謂災眚。'
        },
    '既済':{'初爻': '曳其輪，濡其尾，无咎。',
    '二爻':'婦喪其茀，勿逐，七日得。' ,
    '三爻':'高宗伐鬼方，三年克之，小人勿用。' ,
    '四爻':'繻有衣袽，終日戒。' ,
    '五爻':'東鄰殺牛，不如西鄰之禴祭，實受其福。' ,
    '上爻':'濡其首，厲。'
        },
    '未済':{'初爻': '濡其尾，吝。',
    '二爻':'曳其輪，貞吉。' ,
    '三爻':'未済，征凶，利涉大川。' ,
    '四爻':'貞吉，悔亡，震用伐鬼方，三年有賞于大国。' ,
    '五爻':'貞吉，无悔，君子之光，有孚，吉。' ,
    '上爻':'有孚于飲酒，无咎，濡其首，有孚失是。'
        },
    }
       
    
def solarTerm_and_date(pre_b_year):
    dongzhi_date = {'name':'冬至', 'month':12, 'd':22.6587, 'a':0.242752, 'deltaYear':0}
    month = dongzhi_date['month']
    d = dongzhi_date['d']
    a = dongzhi_date['a']
    deltaYear = dongzhi_date['deltaYear']
    day = int(d + (a * (pre_b_year + deltaYear - 1900 )) - int((pre_b_year + deltaYear - 1900) / 4))
    return datetime.datetime(pre_b_year, month , day)

def cal_days(b_year,b_month,b_day):
    birth_days = datetime.datetime(b_year, b_month, b_day)
    dongzhi_date_days=solarTerm_and_date(b_year-1)
    add_days = birth_days - dongzhi_date_days 
    if add_days.days + 1 <365:
       return add_days.days + 1
    else:
        dongzhi_date_days=solarTerm_and_date(b_year)
        add_days = birth_days - dongzhi_date_days
        return  add_days.days + 1  

def demend_gua(days):
    quo=int(days//(6+7/80))
    return liushisi_gua[quo]

def demend_yao(days):
    remainder=float(days%(6+7/80))
    yao_per_day=(6+7/80)/6
    yao_rank = yao_list[int(remainder/yao_per_day)]
    return yao_rank 
    
st.title('分卦直日法を用いた占い')

with st.form('form', clear_on_submit=False):
    b_year = st.number_input('誕生年を入力してください', min_value=1950,
                           max_value=2050, value=2000, step=1)
    b_month = st.number_input('誕生月を入力してください', min_value=1, max_value=12, value=1)
    b_day = st.number_input('誕生日を入力してください', min_value=1, max_value=31, value=1)
    submit_btn = st.form_submit_button('送信')

if submit_btn:
    try:
        b_gua = demend_gua(cal_days(b_year,b_month,b_day))
        b_yao = demend_yao(cal_days(b_year,b_month,b_day))
                        
        st.write(f'#### 誕生日の卦:{b_gua}')
        st.write(f'#### 誕生日の爻:{b_yao}')
        st.write(f'#### 占辞:{yaoci[b_gua][b_yao]}')
    
    except ValueError:
        st.write('#### エラー！ 正確な値を入力してください')

if __name__ == '__main__':
  print(demend_gua(218))
  print(demend_yao(219))

